#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DNSimple/sentinel-demo/runs/run-cMbhYZp2kJuWSn98

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
dnsimple_registered_domain.domain_a: Refreshing state... [name=dnsimple-1-0-terraform.bio]
dnsimple_registered_domain.domain_b: Refreshing state... [name=om18mg66p0rpbryzc45fnf2o7i23wr4afaddg9iybsi1f8v35qzmjy259evetm.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # dnsimple_domain_delegation.domain_a will be created
  + resource "dnsimple_domain_delegation" "domain_a" {
      + domain       = "dnsimple-1-0-terraform.bio"
      + id           = (known after apply)
      + name_servers = [
          + "ns1.dnsimple.com",
          + "ns2.dnsimple.com",
          + "ns3.dnsimpl.com",
          + "ns4.dnsimple-edge.org",
        ]
    }

  # dnsimple_domain_delegation.domain_b will be created
  + resource "dnsimple_domain_delegation" "domain_b" {
      + domain       = "om18mg66p0rpbryzc45fnf2o7i23wr4afaddg9iybsi1f8v35qzmjy259evetm.com"
      + id           = (known after apply)
      + name_servers = [
          + "ns1.dnsimple.com",
          + "ns2.dnsimple.com",
          + "ns3.dnsimple.com",
          + "ns4.dnsimple-edge.org",
        ]
    }

  # dnsimple_registered_domain.domain_a will be updated in-place
  ~ resource "dnsimple_registered_domain" "domain_a" {
      ~ account_id            = 2038 -> (known after apply)
      ~ auto_renew_enabled    = false -> true
      ~ dnssec_enabled        = false -> true
      ~ expires_at            = "2024-04-19T10:57:00Z" -> (known after apply)
        id                    = 313125
        name                  = "dnsimple-1-0-terraform.bio"
      + registrant_change     = (known after apply)
      ~ state                 = "registered" -> (known after apply)
      ~ transfer_lock_enabled = false -> true
      ~ unicode_name          = "dnsimple-1-0-terraform.bio" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # dnsimple_registered_domain.domain_b will be updated in-place
  ~ resource "dnsimple_registered_domain" "domain_b" {
      ~ account_id            = 2038 -> (known after apply)
      ~ auto_renew_enabled    = false -> true
      ~ dnssec_enabled        = false -> true
      ~ expires_at            = "2024-09-19T05:44:39Z" -> (known after apply)
        id                    = 317883
        name                  = "om18mg66p0rpbryzc45fnf2o7i23wr4afaddg9iybsi1f8v35qzmjy259evetm.com"
      + registrant_change     = (known after apply)
      ~ state                 = "registered" -> (known after apply)
      ~ unicode_name          = "om18mg66p0rpbryzc45fnf2o7i23wr4afaddg9iybsi1f8v35qzmjy259evetm.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

Organization Policy Check:

================ Results for policy set: <empty policy set name> ===============

Sentinel Result: false

This result means that one or more Sentinel policies failed. More than likely,
this was due to the discovery of violations by the main rule and other
sub-rules. Please see the details of the policies executed below to find the
violation(s), which is usually indicated by a rule with a false boolean value,
or non-zero collection data.

1 policies evaluated.

## Policy 1: sentinel-demo-policy (hard-mandatory)

Result: false

Print messages:

	========================================================================
 	Name        : policies.sentinel
 	Provider    : dnsimple/dnsimple
 	Resource    : dnsimple_registered_domain
 	Parameter   : whois_privacy_enabled
 	========================================================================
 	For a list of allowed parameter options see:
 	https://github.com/dnsimple/policy-library-dnsimple-terraform/blob/main/README.md

	========================================================================
 	RESOURCE VIOLATIONS
 	The domain whois_privacy_enabled state should be ${whois_privacy_state}
 	========================================================================	
	 name       : domain_b
	 type       : dnsimple_registered_domain
	 address    : dnsimple_registered_domain.domain_b
	 message    : false is not an allowed whois_privacy_enabled state.	
 	------------------------------------------------------------------------	
	 Resources out of compliance: 1
 	------------------------------------------------------------------------	

./sentinel-demo-policy.sentinel:305:1 - Rule "main"
  Value:
    false

./sentinel-demo-policy.sentinel:281:1 - Rule "auto_renew"
  Value:
    true

./sentinel-demo-policy.sentinel:285:1 - Rule "whois_privacy"
  Value:
    false



```

</details>

*Pusher: @DXTimer, Action: `pull_request`*